
class Messages:

    START_MSG = "Hi there {}.\n\nමම යූටියුබ් උඩුගත කිරීමේ බොට් ය. ඔබ මට අවසර දුන් පසු ඔබට ඕනෑම විදුලි පණිවුඩයක් යූ ටියුබ් වෙත උඩුගත කළ හැකිය.ඔබට වැඩි විස්තර දැනගත හැකිය /help.\n\nThank you."

    HELP_MSG = [
        ".",
        "ආයුබෝවන්. First n \ n පළමුවෙන්ම දේවල්. යූ ටියුබ් විසින් උඩුගත කරන ලද සෑම වීඩියෝවක්ම ක්‍රියාවට නංවන බව ඔබ දැන සිටිය යුතු අතර, එය උඩුගත කළ විගසම පිටපත් ලිවූ අන්තර්ගතය සොයාගත හොත් එය ප්‍රකාශන හිමිකම සඳහා වීඩියෝව සලකුණු කිරීම පුදුම සහගතය, ඔබට වීඩියෝව ප්‍රකාශයට පත් කිරීමට නොහැකි වනු ඇත. \ N \ මා වැඩ කරන්නේ කෙසේදැයි දැන ගැනීමට සියලු පිටු හරහා කියවන්න. ",

        "** මා වැඩ කරන ආකාරය ඉගෙන ගනිමු. ** \ n \ n ** පියවර 1: ** __ ඔබේ යූ ටියුබ් නාලිකාවට උඩුගත කිරීමට ඔබ මට අවසර දී ඇත. එන පිටුවල මේ ගැන වැඩි විස්තර .__ \ n \ n ** පියවර 2: * * __ ඔබ ඕනෑම ටෙලිග්‍රාම් වීඩියෝවක් මා වෙත යොමු කරයි .__ \ n \ n ** පියවර 3: ** __ ඔබ පිළිතුරු දුන් __ / උඩුගත කළ වීඩියෝ ගොනුව වෙත. __` / upload` අනුගමනය කරන්න .__ මාතෘකාවක් ලබා දී නොමැති නම්, ගොනු නාමය මාතෘකාවක් ලෙස භාවිතා කරනු ඇත .__ \ n \ n ** පියවර 4: ** __ මම දුරස්ථව ගොනුව බාගත කර ඔබගේ යූ ටියුබ් නාලිකාවට උඩුගත කරමි .__ \ n \ n ** පියවර 5: ** __ උඩුගත කිරීමෙන් පසු මම ඔබට යූ ටියුබ් සබැඳිය එවමි .__ ",

        "** ඔබේ යූ ටියුබ් නාලිකාව සාදන්න ** \ n \ n ඔබට යූ ටියුබ් චැනලයක් නොමැති නම් මා භාවිතා කිරීමෙන් පලක් නැත. එබැවින් එකක් නිර්මාණය කිරීම සඳහා දී ඇති පියවර අනුගමනය කරන්න. පරිගණකයකින් හෝ ජංගම දුරකථනයෙන් යූ ටියුබ් වෙත .__ \ n \ n ** පියවර 2: ** __ වීඩියෝවක් උඩුගත කිරීම, අදහස් දැක්වීමක් හෝ ධාවන ලැයිස්තුවක් නිර්මාණය කිරීම වැනි නාලිකාවක් අවශ්‍ය ඕනෑම ක්‍රියාවක් උත්සාහ කරන්න .__ \ n \ n ** පියවර 3: ** __ ඔබට තවමත් නාලිකාවක් නොමැති නම්, ඔබට නාලිකාවක් නිර්මාණය කිරීමට විමසීමක් පෙනෙනු ඇත .__ \ n \ n ** පියවර 4: ** __ විස්තර පරීක්ෂා කර ඔබගේ නව නාලිකාව නිර්මාණය කිරීමට තහවුරු කරන්න .__ ",

        "** ඔබගේ යූ ටියුබ් ගිණුම සත්‍යාපනය කරන්න ** \ n \ n යූ ටියුබ් අයාචිත තැපැල් හා අපයෝජනය ඉතා බැරෑරුම් ලෙස සලකන්න. එබැවින් ඔබගේ යූ ටියුබ් ගිණුම සත්‍යාපනය කිරීමට ඔබෙන් ඉල්ලා සිටිනු ඇත. ඔබ ඔබේ ගිණුම සත්‍යාපනය කළ පසු ඔබට විනාඩි 15 කට වඩා වැඩි කාලයක් වීඩියෝ උඩුගත කළ හැකිය. ඔබ ඔබගේ ගිණුම සත්‍යාපනය කර නොමැති නම්, උඩුගත කරන ලද සෑම වීඩියෝවක්ම විනාඩි 15 කට වඩා දිගු වේ. \ N [ඔබගේ යූ ටියුබ් ගිණුම මෙහි සත්‍යාපනය කරන්න.] (Http://www.youtube.com/verify) \ n \ n__ සත්‍යාපනය කිරීමට මතක තබා ගන්න ඔබේ ව්‍යාපෘතිය, එසේ නොමැතිනම් ඔබගේ උඩුගත කිරීම් පුද්ගලිකව තබා ගනු ඇත .__ ",

        "** දැන් අවසර දීමට ඉඩ දෙන්න. ** \ n \ n ඔබේ යූ ටියුබ් ගිණුමට වීඩියෝ උඩුගත කිරීමට ඔබට මට ප්‍රවේශය ලබා දිය යුතුය. ඒ සඳහා ලබා දී ඇති සබැඳිය විවෘත කර කේතය පිටපත් කර ප්‍රවේශ වීමට ඉඩ දෙන්න. නැවත මෙහි පැමිණ` / බලයලත් පිටපතක් ටයිප් කරන්න. -කෝඩ් කර එය යවන්න. \ n \ n ** බිය නොවන්න! ** \ n මම හැකර්වරයකු හෝ මිනිසුන්ගේ පෞද්ගලිකත්වයට රිංගා ගැනීමට කැමති අයෙක් නොවේ. මම කෙනෙකුගේ පෞද්ගලිකත්වයට ගරු කරමි. මම මෙහි සිටින්නේ අවශ්‍ය ඕනෑම කෙනෙකුට උදව් කිරීමට ය උදව් කරන්න මම හැකර් කෙනෙක් නම් මම ටෙලිග්‍රාම් බොට්ස් ලිවීමට මෙහි නොසිටිමි."
    ]

    NOT_A_REPLY_MSG = "Please reply to some video file."

    NOT_A_MEDIA_MSG = "No media file found. "+NOT_A_REPLY_MSG

    NOT_A_VALID_MEDIA_MSG = "This is not a valid media"
    
    DAILY_QOUTA_REACHED = "Looks like you are trying to upload more than 6 videos today! By default youtube only allows about 6 uploads daily, so this request might fail!!"

    PROCESSING = "Processing....."

    NOT_AUTHENTICATED_MSG = "You have not authenticated me to upload video to any account. see /help to authenticate"

    NO_AUTH_CODE_MSG = "There is no code. Please provide some code"

    AUTH_SUCCESS_MSG = "Congrats, you have successfully authenticated me to upload to Youtube.\nHappy uploading!"

    AUTH_FAILED_MSG = "Authentication failed\nDetails:{}"
    
    AUTH_DATA_SAVE_SUCCESS = "Successfully saved the given auth data!"
    
